//	Какое будет выведено значение: let x = 5; alert( x++ ); ?
//5

//	Чему равно такое выражение: [ ] + false - null + true ?
//NaN

//	Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?
//2

//	Чему равна сумма [ ] + 1 + 2?
//12(string)

//	Что выведет этот код: alert( "1"[0] )?
//1(string)

//	Чему равно 2 && 1 && null && 0 && undefined ?
//null

//	Есть ли разница между выражениями? !!( a && b ) и (a && b)?
//false

//	Что выведет этот код: alert( null || 2 && 3 || 4 ); ?
//3

//	a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ?
//false

//	Что выведет этот код: alert( +"Infinity" ); ?
//Infinity(Number)

//	Верно ли сравнение: "Ёжик" > "яблоко"?
//False

//	Чему равно 0 || "" || 2 || undefined || true || falsе ?
//2
